NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/old/nrf_log.h
#define NRF_LOG(...)                    log_rtt_write_string(LOG_TERMINAL_NORMAL, NUM_VA_ARGS(__VA_ARGS__), ##__VA_ARGS__)      /*!< Print a log message. The input string must be null-terminated. */
#define NRF_LOG_DEBUG(...)              log_rtt_write_string(LOG_TERMINAL_NORMAL, NUM_VA_ARGS(__VA_ARGS__), ##__VA_ARGS__)      /*!< If DEBUG is set, print a log message. The input string must be null-terminated. */
#define NRF_LOG_ERROR(...)              log_rtt_write_string(LOG_TERMINAL_ERROR, NUM_VA_ARGS(__VA_ARGS__), ##__VA_ARGS__)       /*!< Print a log message to the error stream. The input string must be null-terminated. */

#define NRF_LOG_HEX(val)                log_rtt_write_hex(LOG_TERMINAL_NORMAL, val)                                             /*!< Log an integer as HEX value (example output: 0x89ABCDEF). */
#define NRF_LOG_HEX_DEBUG(val)          log_rtt_write_hex(LOG_TERMINAL_NORMAL, val)                                             /*!< If DEBUG is set, log an integer as HEX value (example output: 0x89ABCDEF). */
#define NRF_LOG_HEX_ERROR(val)          log_rtt_write_hex(LOG_TERMINAL_ERROR, val)                                              /*!< Log an integer as HEX value to the error stream (example output: 0x89ABCDEF). */

#define NRF_LOG_HEX_CHAR(val)           log_rtt_write_hex_char(LOG_TERMINAL_NORMAL, val)                                        /*!< Log a character as HEX value (example output: AA). */
#define NRF_LOG_HEX_CHAR_DEBUG(val)     log_rtt_write_hex_char(LOG_TERMINAL_NORMAL, val)                                        /*!< If DEBUG is set, log a character as HEX value (example output: AA). */
#define NRF_LOG_HEX_CHAR_ERROR(val)     log_rtt_write_hex_char(LOG_TERMINAL_ERROR, val)                                         /*!< Log a character as HEX value to the error stream (example output: AA). */

#define NRF_LOG_HAS_INPUT()             log_rtt_has_input()                                                                     /*!< Check if the input buffer has unconsumed characters. */
#define NRF_LOG_READ_INPUT(p_char)      log_rtt_read_input(p_char)                                                              /*!< Consume a character from the input buffer. */

#if !defined(DEBUG) && !defined(DOXYGEN)

#undef NRF_LOG_DEBUG
#define NRF_LOG_DEBUG(...)

#undef NRF_LOG_STR_DEBUG
#define NRF_LOG_STR_DEBUG(...)

#undef NRF_LOG_HEX_DEBUG
#define NRF_LOG_HEX_DEBUG(...)

#undef NRF_LOG_HEX_CHAR_DEBUG
#define NRF_LOG_HEX_CHAR_DEBUG(...)

#endif // !defined(DEBUG) && !defined(DOXYGEN)

#elif defined(NRF_LOG_USES_UART) && NRF_LOG_USES_UART == 1

/**@brief Function for initializing the UART logger.
 *
 * This function is available only when NRF_LOG_USES_UART is defined as 1.
 *
 * @note Do not call this function directly. Use the macro @ref NRF_LOG_INIT instead.
 *
 * @retval     NRF_SUCCESS     If initialization was successful.
 * @retval     NRF_ERROR       Otherwise.
 */
uint32_t log_uart_init(void);

/**@brief Function for logging a printf string to UART.
 *
 * @details  Printf requires more processor time
 * than other logging functions. Therefore, applications that require logging
 * but need it to interfere as little as possible with the execution, should
 * avoid using printf.
 *
 * This function is available only when NRF_LOG_USES_UART is defined as 1.
 *
 * @note This function is non-blocking. If too much data is sent to the UART,
 *          some characters might be skipped.
 *
 * @note Do not call this function directly. Use one of the following macros instead:
 * - @ref NRF_LOG_PRINTF
 * - @ref NRF_LOG_PRINTF_DEBUG
 * - @ref NRF_LOG_PRINTF_ERROR
 *
 * @param  format_msg      Printf format string.
 */
void log_uart_printf(const char * format_msg, ...);

/**@brief Function for logging a single character to UART.
 *
 * This function is available only when NRF_LOG_USES_UART is defined as 1.
 *
 * @param  c     Character.
 */
void log_uart_write_char(const char c);

/**@brief Function for logging null-terminated strings to UART.
 *
 * @details This function is more efficient than using printf.
 *          The null termination will not be logged.
 *
 * This function is available only when NRF_LOG_USES_UART is defined as 1.
 *
 * @note Do not call this function directly. Use one of the following macros instead:
 * - @ref NRF_LOG
 * - @ref NRF_LOG_DEBUG
 * - @ref NRF_LOG_ERROR
 *
 * @param  num_args     Number of arguments.
 */
void log_uart_write_string_many(int num_args, ...);


/**@brief Function for logging a null-terminated string to UART.
 *
 * @details This function is more efficient than using printf.
 *          The null termination will not be logged.
 *
 * This function is available only when NRF_LOG_USES_UART is defined as 1.
 *
 * @note Do not call this function directly. Use one of the following macros instead:
 * - @ref NRF_LOG
 * - @ref NRF_LOG_DEBUG
 * - @ref NRF_LOG_ERROR
 *
 * @param  msg     Null-terminated string.
 */
void log_uart_write_string(const char* msg);


/**@brief Function for logging an integer value as HEX to UART.
 *
 * @details The output data is formatted as, for example, 0x89ABCDEF.
 * This function is more efficient than printf.
 *
 * This function is available only when NRF_LOG_USES_UART is defined as 1.
 *
 * @note This function is non-blocking. If too much data is sent to the UART,
 *          some characters might be skipped.
 *
 * @note Do not call this function directly. Use one of the following macros instead:
 * - @ref NRF_LOG_HEX
 * - @ref NRF_LOG_HEX_DEBUG
 * - @ref NRF_LOG_HEX_ERROR
 *
 * @param   value   Integer value to be printed as HEX.
 */
void log_uart_write_hex(uint32_t value);

/**@brief Function for logging a single character as HEX to UART.
 *
 * @details The output string is formatted as, for example, AA.
 *
 * This function is available only when NRF_LOG_USES_UART is defined as 1.
 *
 * @note This function is non-blocking. If too much data is sent to the UART,
 *          some characters might be skipped.
 *
 * @note Do not call this function directly. Use one of the following macros instead:
 * - @ref NRF_LOG_HEX_CHAR
 * - @ref NRF_LOG_HEX_CHAR_DEBUG
 * - @ref NRF_LOG_HEX_CHAR_ERROR
 *
 * @param c Character.
  */
void log_uart_write_hex_char(uint8_t c);

/**@brief Function for checking if data is available in the input buffer.
 *
 * This function is available only when NRF_LOG_USES_UART is defined as 1.
 *
 * @note Do not call this function directly. Use @ref NRF_LOG_HAS_INPUT instead.
 *
 * @retval      1 If characters are available to read.
 * @retval      0 If no characters are available.
 */
int log_uart_has_input(void);

